app/controllers/errors_controller.rb

SELECT "errors".* FROM "errors"
---
  def index
    @errors = Error.all

INSERT INTO "errors" ("error_type", "severity", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["error_type", nil], ["severity", 1], ["description", "Debugger"], ["created_at", "2023-06-08 18:59:54.156028"], ["updated_at", "2023-06-08 18:59:54.156028"]]
---
  def create
    @error = Error.new(error_params)

    respond_to do |format|
      if @error.save

SELECT "errors".* FROM "errors" WHERE "errors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_error
      @error = Error.find(params[:id])